org/3_iterative.org
#+title: Iterative modeling
#+startup: overview hideblocks indent inlineimages
#+property: header-args:R :results output :noweb yes
#+property: header-args:python :results output :noweb yes :session *Python* :exports both
#+options: toc:1 num:1
* README

Improving quality of the code and quality of the model.

- Iterating the bike share model
- Using more than one ~State~ object
- Adding docstrings
- Dealing with negative bikes
- Introducing comparison operators
- Introducing metrics
- Summary and exercises

* Iterative modeling

Iterative modeling means starting with a simple model, identifying the
most important issues for the problem setting, and making gradual
improvements.

What assumptions is the bike share model based on? In which ways is it
unrealistic - what are the differences between the model and the real
world?

1. Customer arrival probability varies over time.
2. Travel time between bike stations is not zero.
3. Bike availability is not guaranteed.
4. LEAP and Community Centre look completely different.
5. There are more customers at the Community Centre.
6. Customers come in different types.
7. Bikes come in different types.
8. Checking out bikes might cost money.

Are any of these more relevant than others? Relevance depends on the
purpose for the modeling simulation. What is our likely purpose?

- Understand the system with its elements, relationships, boundary and
  the resulting states.

For this purpose, specific details about the elements (e.g. type of
bike or type of customer) could be important once we've understood the
basic dynamics (i.e. evolution over time).

The different looks (and location in town) of our stations might
affect the arrival/checkout probability: more students at LEAP but
more people overall at the Community Centre.

Types of customer is important if we're trying to make a prediction by
customer type - like "which age group is most likely to check out a
bike?" Same for the bike type - which bikes should we buy?

The first assumption (time dependency) can be neglected if we simulate
over a short period of time (like one hour).

The second assumption (travel time between stations) might not affect
the results very much depending on the distance between stations - but
if we're after the impact of this feature on the dynamic of the model,
we have to add it.

The third assumption is important because negative bike numbers are an
obvious violation of the physical laws and just don't make sense.

* Using more than one ~State~ object

What if there is more than one bike share system, or if we want to run
more than one simulation? We need to be able to define more than one
set of state variables.

Import ~modsim~, then redefine the update functions:
#+begin_src python :results silent
  # import State from modsim
  from modsim import State, show, source_code, flip, TimeSeries

  # redefine `bike_to_city()` to take the argument `state`
  def bike_to_city(state):
      print("Moving bike to city Community Center.")
      state.leap -= 1
      state.city += 1

  # redefine `bike_to_city()` to take the argument `state`
  def bike_to_leap(state):
      print("Moving bike to Lyon's LEAP.")
      state.leap += 1
      state.city -= 1
#+end_src

The value of ~state~ could be any ~State~ object not just ~bikeshare~. When
we now update the bike stations, we need to supply a ~State~ object:
#+begin_src python
  # Initialize a `bikeshare` State
  bikeshare = State(city=10,leap=2)

  # Move a bike to city
  bike_to_city(bikeshare)

  # Show the state of `bikeshare`
  print(show(bikeshare))
#+end_src

#+RESULTS:
: Moving bike to city Community Center.
:       state
: city     11
: leap      1

The update call has the same effect as:
#+begin_example python
  state = bikeshare
  state.leap -= 1
  state.city += 1
#+end_example

Notice the difference between the ~state~ parameter in the update
function, and the ~State~ function, which defines a ~state~.

Now we can create as many ~State~ objects as we want, and update them
independently:
#+begin_src python
  # define two states, `bikeshare1` and `bikeshare2`
  bikeshare1 = State(city=10,leap=2)
  bikeshare2 = State(city=2,leap=10)

  # Move a bike to city in both states and show them
  bike_to_city(bikeshare1)
  print(show(bikeshare1))
  bike_to_city(bikeshare2)  
  print(show(bikeshare2))
  #+end_src

#+RESULTS:
: Moving bike to city Community Center.
:       state
: city     11
: leap      1
: Moving bike to city Community Center.
:       state
: city      3
: leap      9

Changes in either state do not affect the other. Now we can simulate
different bike share systems (e.g. different initial conditions), or
run multiple simulations.

