org/3_iterative.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-26 Tue 14:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Iterative modeling</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Iterative modeling</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8b1a596">1. README</a></li>
<li><a href="#orgaa80fcd">2. Iterative modeling</a></li>
<li><a href="#orgfda7779">3. Using more than one <code>State</code> object</a></li>
<li><a href="#org9350010">4. Adding docstrings</a></li>
<li><a href="#org304bab8">5. Scope and keyword parameter</a></li>
<li><a href="#org5f85b0f">6. Dealing with negative bikes</a></li>
<li><a href="#orgf7d9d24">7. Using comparison operators</a></li>
<li><a href="#orgf583721">8. Defining simulation metrics</a></li>
<li><a href="#org9802591">9. Measuring the number of unhappy customers</a></li>
<li><a href="#org793a24d">10. Concept and code summary</a></li>
<li><a href="#org6b768ed">11. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8b1a596" class="outline-2">
<h2 id="org8b1a596"><span class="section-number-2">1.</span> README</h2>
<div class="outline-text-2" id="text-1">
<p>
Improving quality of the code and quality of the model.
</p>

<ul class="org-ul">
<li>Iterating the bike share model</li>
<li>Using more than one <code>State</code> object</li>
<li>Adding docstrings</li>
<li>Dealing with negative bikes</li>
<li>Introducing comparison operators</li>
<li>Introducing metrics</li>
<li>Summary and exercises</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa80fcd" class="outline-2">
<h2 id="orgaa80fcd"><span class="section-number-2">2.</span> Iterative modeling</h2>
<div class="outline-text-2" id="text-2">
<p>
Iterative modeling means starting with a simple model, identifying the
most important issues for the problem setting, and making gradual
improvements.
</p>

<p>
What assumptions is the bike share model based on? In which ways is it
unrealistic - what are the differences between the model and the real
world?
</p>

<ol class="org-ol">
<li>Customer arrival probability varies over time.</li>
<li>Travel time between bike stations is not zero.</li>
<li>Bike availability is not guaranteed.</li>
<li>LEAP and Community Centre look completely different.</li>
<li>There are more customers at the Community Centre.</li>
<li>Customers come in different types.</li>
<li>Bikes come in different types.</li>
<li>Checking out bikes might cost money.</li>
</ol>

<p>
Are any of these more relevant than others? Relevance depends on the
purpose for the modeling simulation. What is our likely purpose?
</p>

<ul class="org-ul">
<li>Understand the system with its elements, relationships, boundary and
the resulting states.</li>
</ul>

<p>
For this purpose, specific details about the elements (e.g. type of
bike or type of customer) could be important once we've understood the
basic dynamics (i.e. evolution over time).
</p>

<p>
The different looks (and location in town) of our stations might
affect the arrival/checkout probability: more students at LEAP but
more people overall at the Community Centre.
</p>

<p>
Types of customer is important if we're trying to make a prediction by
customer type - like "which age group is most likely to check out a
bike?" Same for the bike type - which bikes should we buy?
</p>

<p>
The first assumption (time dependency) can be neglected if we simulate
over a short period of time (like one hour).
</p>

<p>
The second assumption (travel time between stations) might not affect
the results very much depending on the distance between stations - but
if we're after the impact of this feature on the dynamic of the model,
we have to add it.
</p>

<p>
The third assumption is important because negative bike numbers are an
obvious violation of the physical laws and just don't make sense.
</p>
</div>
</div>

<div id="outline-container-orgfda7779" class="outline-2">
<h2 id="orgfda7779"><span class="section-number-2">3.</span> Using more than one <code>State</code> object</h2>
<div class="outline-text-2" id="text-3">
<p>
What if there is more than one bike share system, or if we want to run
more than one simulation? We need to be able to define more than one
set of state variables.
</p>

<p>
Import <code>modsim</code>, then redefine the update functions:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">import State from modsim</span>
<span style="color: #b6a0ff; font-weight: bold;">from</span> modsim <span style="color: #b6a0ff; font-weight: bold;">import</span> State, show, source_code, flip, TimeSeries

<span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">redefine `bike_to_city()` to take the argument `state`</span>
<span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_city</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"Moving bike to city Community Center."</span><span style="color: #ffffff;">)</span>
    state.<span style="color: #00d3d0;">leap</span> -= 1
    state.<span style="color: #00d3d0;">city</span> += 1

<span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">redefine `bike_to_city()` to take the argument `state`</span>
<span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_leap</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"Moving bike to Lyon's LEAP."</span><span style="color: #ffffff;">)</span>
    state.<span style="color: #00d3d0;">leap</span> += 1
    state.<span style="color: #00d3d0;">city</span> -= 1
</pre>
</div>

<p>
The value of <code>state</code> could be any <code>State</code> object not just <code>bikeshare</code>. When
we now update the bike stations, we need to supply a <code>State</code> object:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">Initialize a `bikeshare` State</span>
<span style="color: #00d3d0;">bikeshare</span> = State<span style="color: #ffffff;">(</span>city=10,leap=2<span style="color: #ffffff;">)</span>

<span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">Move a bike to city</span>
bike_to_city<span style="color: #ffffff;">(</span>bikeshare<span style="color: #ffffff;">)</span>

<span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">Show the state of `bikeshare`</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
Moving bike to city Community Center.
      state
city     11
leap      1
</pre>


<p>
The update call has the same effect as:
</p>
<pre class="example" id="org8436fa9">
state = bikeshare
state.leap -= 1
state.city += 1
</pre>

<p>
Notice the difference between the <code>state</code> parameter in the update
function, and the <code>State</code> function, which defines a <code>state</code>.
</p>

<p>
Now we can create as many <code>State</code> objects as we want, and update them
independently:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">define two states, `bikeshare1` and `bikeshare2`</span>
<span style="color: #00d3d0;">bikeshare1</span> = State<span style="color: #ffffff;">(</span>city=10,leap=2<span style="color: #ffffff;">)</span>
<span style="color: #00d3d0;">bikeshare2</span> = State<span style="color: #ffffff;">(</span>city=2,leap=10<span style="color: #ffffff;">)</span>

<span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">Move a bike to city in both states and show them</span>
bike_to_city<span style="color: #ffffff;">(</span>bikeshare1<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare1<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
bike_to_city<span style="color: #ffffff;">(</span>bikeshare2<span style="color: #ffffff;">)</span>  
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare2<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
Moving bike to city Community Center.
      state
city     11
leap      1
Moving bike to city Community Center.
      state
city      3
leap      9
</pre>


<p>
Changes in either state do not affect the other. Now we can simulate
different bike share systems (e.g. different initial conditions), or
run multiple simulations.
</p>
</div>
</div>
