org/3_iterative.org
* Adding docstrings

There are two types of in-program documentation:
1) comments (use liberally) after ~#~
2) docstrings (use strategically) between ~"""~ 

In IPython, you get the docstring when asking for help with ~?~.

Add the following documentation to the update functions by printing
the text between two sets of ~"""~ marks on the next line after the ~def~
line, then print the docstring:
#+begin_example
  """Move one bike from [station1] to [station2]
     state: bikeshare State object
  """
#+end_example
#+begin_src python :results silent
  def bike_to_city(state):
      """Move one bike from LEAP to city community center.

      state: bikeshare State object
      """
      print("Moving bike to city Community Center.")
      state.leap -= 1
      state.city += 1

  def bike_to_leap(state):
      """Move one bike from city community center to LEAP.

      state: bikeshare State object
      """
      print("Moving bike to Lyon's LEAP.")
      state.leap += 1
      state.city -= 1
#+end_src

Calling the help with ~help~:
#+begin_src python
  help(bike_to_city)
  help(bike_to_leap)  
#+end_src

#+RESULTS:
#+begin_example
Help on function bike_to_city in module __main__:

bike_to_city(state)
    Move one bike from LEAP to city community center.
    
    state: bikeshare State object

Help on function bike_to_leap in module __main__:

bike_to_leap(state)
    Move one bike from city community center to LEAP.
    
    state: bikeshare State object
#+end_example

What happens if you enter ~help(bike_to_city())~ and
~help(bike_to_city(state))~ - explain the errors!

* Scope and keyword parameter

You can call the function ~updateState~ without argument because the
function definition has a default value.
#+begin_src python
  from modsim import State, show

  def updateState(state=State(variable=10)):
      state.variable -= 1
      return print(show(state))

  updateState()
  #+end_src

#+RESULTS:
:           state
: variable      9

If you return ~state~ from within the function, it will not be known
outside unless
#+begin_src python
  from modsim import State, show

  def updateState(state=State(variable=10)):
      state.variable -= 1
      return state

  Zustand = updateState()
  print(show(Zustand))
  try:
      print(state)
  except NameError:
      print("`state` is not known")
  #+end_src

  #+RESULTS:
  :           state
  : variable      9
  : `state` is not known

* Dealing with negative bikes

To account for negative bikes, add a conditional statement to the
update function and test if the update would lead to a negative
~state.leap~, the state at the LEAP station:
#+begin_src python :results silent
  def bike_to_city(state):
      if state.leap == 0:
          return
      state.city += 1
      state.leap -= 1
#+end_src

Test this function for zero and non-zero values of ~state.city~:
#+begin_src python
  ## ten bikes at city, 2 bikes at leap
  bikeshare1 = State(city=10,leap=2)
  bike_to_city(bikeshare1)
  print(show(bikeshare1))
  ## all bikes at city, no bikes at leap
  bikeshare2 = State(city=12,leap=0)
  bike_to_city(bikeshare2)  # this would lead to leap = -1
  print(show(bikeshare2))
#+end_src

#+RESULTS:
:       state
: city     11
: leap      1
:       state
: city     12
: leap      0

When a function encounters a ~return~ statement with or without return
value, it ends immediately ignoring the remainder of its statements.

No more negative bikes at LEAP. Write an update function so that at
the city community center we will also never have negative bikes:
#+begin_src python :results silent
  def bike_to_leap(state):
      if state.city == 0:
          return
      state.leap += 1
      state.city -= 1
#+end_src
Test the function ~bike_to_leap~ for negative bikes at LEAP:
#+begin_src python
  ## 7 bikes at leap, 5 bikes at city
  bikeshare1 = State(leap=7,city=5)
  bike_to_leap(bikeshare1)
  print(show(bikeshare1))
  ## all bikes at leap, no bikes at city
  bikeshare2 = State(leap=12,city=0)
  bike_to_leap(bikeshare2)
  print(show(bikeshare2))
#+end_src

#+RESULTS:
:       state
: leap      8
: city      4
:       state
: leap     12
: city      0

