org/3_iterative.html

<div id="outline-container-org9350010" class="outline-2">
<h2 id="org9350010"><span class="section-number-2">4.</span> Adding docstrings</h2>
<div class="outline-text-2" id="text-4">
<p>
There are two types of in-program documentation:
</p>
<ol class="org-ol">
<li>comments (use liberally) after <code>#</code></li>
<li>docstrings (use strategically) between <code>"""</code></li>
</ol>

<p>
In IPython, you get the docstring when asking for help with <code>?</code>.
</p>

<p>
Add the following documentation to the update functions by printing
the text between two sets of <code>"""</code> marks on the next line after the <code>def</code>
line, then print the docstring:
</p>
<pre class="example" id="org7d82b83">
"""Move one bike from [station1] to [station2]
   state: bikeshare State object
"""
</pre>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_city</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #9ac8e0;">"""Move one bike from LEAP to city community center.</span>

<span style="color: #9ac8e0;">    state: bikeshare State object</span>
<span style="color: #9ac8e0;">    """</span>
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"Moving bike to city Community Center."</span><span style="color: #ffffff;">)</span>
    state.<span style="color: #00d3d0;">leap</span> -= 1
    state.<span style="color: #00d3d0;">city</span> += 1

<span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_leap</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #9ac8e0;">"""Move one bike from city community center to LEAP.</span>

<span style="color: #9ac8e0;">    state: bikeshare State object</span>
<span style="color: #9ac8e0;">    """</span>
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"Moving bike to Lyon's LEAP."</span><span style="color: #ffffff;">)</span>
    state.<span style="color: #00d3d0;">leap</span> += 1
    state.<span style="color: #00d3d0;">city</span> -= 1
</pre>
</div>

<p>
Calling the help with <code>help</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #f78fe7; font-weight: bold;">help</span><span style="color: #ffffff;">(</span>bike_to_city<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">help</span><span style="color: #ffffff;">(</span>bike_to_leap<span style="color: #ffffff;">)</span>  
</pre>
</div>

<pre class="example" id="org975f1d2">
Help on function bike_to_city in module __main__:

bike_to_city(state)
    Move one bike from LEAP to city community center.
    
    state: bikeshare State object

Help on function bike_to_leap in module __main__:

bike_to_leap(state)
    Move one bike from city community center to LEAP.
    
    state: bikeshare State object
</pre>

<p>
What happens if you enter <code>help(bike_to_city())</code> and
<code>help(bike_to_city(state))</code> - explain the errors!
</p>
</div>
</div>

<div id="outline-container-org304bab8" class="outline-2">
<h2 id="org304bab8"><span class="section-number-2">5.</span> Scope and keyword parameter</h2>
<div class="outline-text-2" id="text-5">
<p>
You can call the function <code>updateState</code> without argument because the
function definition has a default value.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff; font-weight: bold;">from</span> modsim <span style="color: #b6a0ff; font-weight: bold;">import</span> State, show

<span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">updateState</span><span style="color: #ffffff;">(</span>state=State<span style="color: #ff66ff;">(</span>variable=10<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>:
    state.<span style="color: #00d3d0;">variable</span> -= 1
    <span style="color: #b6a0ff; font-weight: bold;">return</span> <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>state<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

updateState<span style="color: #ffffff;">()</span>
</pre>
</div>

<pre class="example">
          state
variable      9
</pre>


<p>
If you return <code>state</code> from within the function, it will not be known
outside unless
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff; font-weight: bold;">from</span> modsim <span style="color: #b6a0ff; font-weight: bold;">import</span> State, show

<span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">updateState</span><span style="color: #ffffff;">(</span>state=State<span style="color: #ff66ff;">(</span>variable=10<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>:
    state.<span style="color: #00d3d0;">variable</span> -= 1
    <span style="color: #b6a0ff; font-weight: bold;">return</span> state

<span style="color: #00d3d0;">Zustand</span> = updateState<span style="color: #ffffff;">()</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>Zustand<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #b6a0ff; font-weight: bold;">try</span>:
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>
<span style="color: #b6a0ff; font-weight: bold;">except</span> <span style="color: #6ae4b9; font-weight: bold;">NameError</span>:
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"`state` is not known"</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
          state
variable      9
`state` is not known
</pre>
</div>
</div>

<div id="outline-container-org5f85b0f" class="outline-2">
<h2 id="org5f85b0f"><span class="section-number-2">6.</span> Dealing with negative bikes</h2>
<div class="outline-text-2" id="text-6">
<p>
To account for negative bikes, add a conditional statement to the
update function and test if the update would lead to a negative
<code>state.leap</code>, the state at the LEAP station:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_city</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #b6a0ff; font-weight: bold;">if</span> state.leap == 0:
        <span style="color: #b6a0ff; font-weight: bold;">return</span>
    state.<span style="color: #00d3d0;">city</span> += 1
    state.<span style="color: #00d3d0;">leap</span> -= 1
</pre>
</div>

<p>
Test this function for zero and non-zero values of <code>state.city</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff9f80;">## </span><span style="color: #ff9f80;">ten bikes at city, 2 bikes at leap</span>
<span style="color: #00d3d0;">bikeshare1</span> = State<span style="color: #ffffff;">(</span>city=10,leap=2<span style="color: #ffffff;">)</span>
bike_to_city<span style="color: #ffffff;">(</span>bikeshare1<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare1<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ff9f80;">## </span><span style="color: #ff9f80;">all bikes at city, no bikes at leap</span>
<span style="color: #00d3d0;">bikeshare2</span> = State<span style="color: #ffffff;">(</span>city=12,leap=0<span style="color: #ffffff;">)</span>
bike_to_city<span style="color: #ffffff;">(</span>bikeshare2<span style="color: #ffffff;">)</span>  <span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">this would lead to leap = -1</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare2<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
      state
city     11
leap      1
      state
city     12
leap      0
</pre>


<p>
When a function encounters a <code>return</code> statement with or without return
value, it ends immediately ignoring the remainder of its statements.
</p>

<p>
No more negative bikes at LEAP. Write an update function so that at
the city community center we will also never have negative bikes:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_leap</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #b6a0ff; font-weight: bold;">if</span> state.city == 0:
        <span style="color: #b6a0ff; font-weight: bold;">return</span>
    state.<span style="color: #00d3d0;">leap</span> += 1
    state.<span style="color: #00d3d0;">city</span> -= 1
</pre>
</div>
<p>
Test the function <code>bike_to_leap</code> for negative bikes at LEAP:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff9f80;">## </span><span style="color: #ff9f80;">7 bikes at leap, 5 bikes at city</span>
<span style="color: #00d3d0;">bikeshare1</span> = State<span style="color: #ffffff;">(</span>leap=7,city=5<span style="color: #ffffff;">)</span>
bike_to_leap<span style="color: #ffffff;">(</span>bikeshare1<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare1<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ff9f80;">## </span><span style="color: #ff9f80;">all bikes at leap, no bikes at city</span>
<span style="color: #00d3d0;">bikeshare2</span> = State<span style="color: #ffffff;">(</span>leap=12,city=0<span style="color: #ffffff;">)</span>
bike_to_leap<span style="color: #ffffff;">(</span>bikeshare2<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare2<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
      state
leap      8
city      4
      state
leap     12
city      0
</pre>
</div>
</div>
