org/3_iterative.org
* Using comparison operators

Don't confuse the assignment operator ~=~ with the comparison operator
~==~. The former distributes computer memory to variables and spits out
nothing while the latter checks equality and spits out a Boolean
value.

The assignment operator does, the comparison operator does not change
the value of its left hand side argument:
#+begin_src python
  x = 5  # changes value of x
  print(x)
  print(x == 5)  # does not change value of x
#+end_src

#+RESULTS:
: 5
: True

What error do you get if you mess this up in a conditional statement?
1) Set x to 5, check ~if~ it is 5 and ~print~ "x is 5" (use an f-string).
2) Now set x to 5 in the conditional statement and run it again.
#+begin_src python
  x = 5
  if x == 5:
      print(f'x is {x}')
#+end_src

#+RESULTS:
: x is 5

Write a conditional statement that checks if x is NOT 5 using the
comparison operator ~!=~. Set x to 6 and print "x is not 5 but 6".
#+begin_src python
  x = 6
  y = 5
  if x != y:
      print(f'x is not {y} but {x}') 
#+end_src

#+RESULTS:
: x is not 5 but 6

* Defining simulation metrics

Our current model is /stochastic/ because the arrival of customers is
dictated by a randomized draw with varying probabilities - it's
different every time.

The opposite extreme would be a /deterministic/ model that does the same
thing every time the model runs. Mathematical models that are based on
evaluating closed mathematical expressions are deterministic by nature.

What would make the model better for the customer? For example knowing
the probability of finding an available bike (to minimize the chance
of not getting one, or maximize the chance of getting one).

What would make the model better for the owner? For example knowing if
a customer got a bike or not (to minimize the number of customers who
don't get a bike or maximize the number of bikes in use).

Statistics that quantify how well the system works are simulation
/metrics/. "How well" is relative to the purpose of the
simulation. Applying metrics boils down to optimization.

* Measuring the number of unhappy customers

Here is a version of ~bike_to_leap~ that keeps track of the number of
unhappy customers, measured in the number of customers who arrive at a
station with no bikes:
#+begin_src python :results silent
  def bike_to_leap(state):
      if state.city == 0:
          state.city_empty += 1  # add one unhappy customer
          return
      state.leap += 1
      state.city -= 1
#+end_src
We have essentially added another state variable to our system. We
need to add it whenever we create a ~State~ object:
#+begin_src python :results silent
  bikeshare = State(leap = 12,
                    city = 0,
                    city_empty = 0)  # initialize with 0 unhappy customers
#+end_src
We test it by calling ~bike_to_leap~ (withdrawing a bike from ~city~):
#+begin_src python
  print(show(bikeshare))
  bike_to_leap(bikeshare)
  print(show(bikeshare))
#+end_src

#+RESULTS:
:             state
: leap           12
: city            0
: city_empty      0
:             state
: leap           12
: city            0
: city_empty      1

* Concept and code summary

Concept:
- Iterative modeling means starting with a simple model, identifying
  the most important issues for the problem setting, and making
  gradual improvements.
- Variables are local to functions, and parameters can have defaults
  when using keywords for them.
- /Stochastic/ models produce different outcomes each time they are run,
  /deterministic/ models produce the same outcome each time they're run.
- Statistics that measure how well the system works are called /metrics/.

Code:
- We used a conditional operator, ~==~, to check whether a bike is
  available, in order to avoid negative bikes.
- We added a parameter, ~state~, so we can work with more than one ~State~
  object.
- We added a docstring that explains how to use a function and a
  comment that explains how it works.
- We added a state variable, ~city_empty~, to count the number of
  unhappy customers, which is a metric we’ll use to quantify how well
  the system works.

* References

Downey AB. Modeling and Simulation in Python. NoStarch
Press; 2023. [[https://allendowney.github.io/ModSimPy/][allendowney.github.io]]

Python Software Foundation. Python (Version 3.8.10). Python Software
Foundation. Published 2021. Accessed August
19, 2023. [[https://www.python.org][python.org]]

