org/3_iterative.html

<div id="outline-container-orgf7d9d24" class="outline-2">
<h2 id="orgf7d9d24"><span class="section-number-2">7.</span> Using comparison operators</h2>
<div class="outline-text-2" id="text-7">
<p>
Don't confuse the assignment operator <code>=</code> with the comparison operator
<code>==</code>. The former distributes computer memory to variables and spits out
nothing while the latter checks equality and spits out a Boolean
value.
</p>

<p>
The assignment operator does, the comparison operator does not change
the value of its left hand side argument:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00d3d0;">x</span> = 5  <span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">changes value of x</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>x == 5<span style="color: #ffffff;">)</span>  <span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">does not change value of x</span>
</pre>
</div>

<pre class="example">
5
True
</pre>


<p>
What error do you get if you mess this up in a conditional statement?
</p>
<ol class="org-ol">
<li>Set x to 5, check <code>if</code> it is 5 and <code>print</code> "x is 5" (use an f-string).</li>
<li>Now set x to 5 in the conditional statement and run it again.</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00d3d0;">x</span> = 5
<span style="color: #b6a0ff; font-weight: bold;">if</span> x == 5:
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">'x is </span>{x}<span style="color: #79a8ff;">'</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
x is 5
</pre>


<p>
Write a conditional statement that checks if x is NOT 5 using the
comparison operator <code>!=</code>. Set x to 6 and print "x is not 5 but 6".
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00d3d0;">x</span> = 6
<span style="color: #00d3d0;">y</span> = 5
<span style="color: #b6a0ff; font-weight: bold;">if</span> x != y:
    <span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">'x is not </span>{y}<span style="color: #79a8ff;"> but </span>{x}<span style="color: #79a8ff;">'</span><span style="color: #ffffff;">)</span> 
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; x is not 5 but 6
</pre>
</div>
</div>

<div id="outline-container-orgf583721" class="outline-2">
<h2 id="orgf583721"><span class="section-number-2">8.</span> Defining simulation metrics</h2>
<div class="outline-text-2" id="text-8">
<p>
Our current model is <i>stochastic</i> because the arrival of customers is
dictated by a randomized draw with varying probabilities - it's
different every time.
</p>

<p>
The opposite extreme would be a <i>deterministic</i> model that does the same
thing every time the model runs. Mathematical models that are based on
evaluating closed mathematical expressions are deterministic by nature.
</p>

<p>
What would make the model better for the customer? For example knowing
the probability of finding an available bike (to minimize the chance
of not getting one, or maximize the chance of getting one).
</p>

<p>
What would make the model better for the owner? For example knowing if
a customer got a bike or not (to minimize the number of customers who
don't get a bike or maximize the number of bikes in use).
</p>

<p>
Statistics that quantify how well the system works are simulation
<i>metrics</i>. "How well" is relative to the purpose of the
simulation. Applying metrics boils down to optimization.
</p>
</div>
</div>

<div id="outline-container-org9802591" class="outline-2">
<h2 id="org9802591"><span class="section-number-2">9.</span> Measuring the number of unhappy customers</h2>
<div class="outline-text-2" id="text-9">
<p>
Here is a version of <code>bike_to_leap</code> that keeps track of the number of
unhappy customers, measured in the number of customers who arrive at a
station with no bikes:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff; font-weight: bold;">def</span> <span style="color: #feacd0;">bike_to_leap</span><span style="color: #ffffff;">(</span>state<span style="color: #ffffff;">)</span>:
    <span style="color: #b6a0ff; font-weight: bold;">if</span> state.city == 0:
        state.<span style="color: #00d3d0;">city_empty</span> += 1  <span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">add one unhappy customer</span>
        <span style="color: #b6a0ff; font-weight: bold;">return</span>
    state.<span style="color: #00d3d0;">leap</span> += 1
    state.<span style="color: #00d3d0;">city</span> -= 1
</pre>
</div>
<p>
We have essentially added another state variable to our system. We
need to add it whenever we create a <code>State</code> object:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00d3d0;">bikeshare</span> = State<span style="color: #ffffff;">(</span>leap = 12,
                  city = 0,
                  city_empty = 0<span style="color: #ffffff;">)</span>  <span style="color: #ff9f80;"># </span><span style="color: #ff9f80;">initialize with 0 unhappy customers</span>
</pre>
</div>
<p>
We test it by calling <code>bike_to_leap</code> (withdrawing a bike from <code>city</code>):
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
bike_to_leap<span style="color: #ffffff;">(</span>bikeshare<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7; font-weight: bold;">print</span><span style="color: #ffffff;">(</span>show<span style="color: #ff66ff;">(</span>bikeshare<span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<pre class="example">
            state
leap           12
city            0
city_empty      0
            state
leap           12
city            0
city_empty      1
</pre>
</div>
</div>

<div id="outline-container-org793a24d" class="outline-2">
<h2 id="org793a24d"><span class="section-number-2">10.</span> Concept and code summary</h2>
<div class="outline-text-2" id="text-10">
<p>
Concept:
</p>
<ul class="org-ul">
<li>Iterative modeling means starting with a simple model, identifying
the most important issues for the problem setting, and making
gradual improvements.</li>
<li>Variables are local to functions, and parameters can have defaults
when using keywords for them.</li>
<li><i>Stochastic</i> models produce different outcomes each time they are run,
<i>deterministic</i> models produce the same outcome each time they're run.</li>
<li>Statistics that measure how well the system works are called <i>metrics</i>.</li>
</ul>

<p>
Code:
</p>
<ul class="org-ul">
<li>We used a conditional operator, <code>==</code>, to check whether a bike is
available, in order to avoid negative bikes.</li>
<li>We added a parameter, <code>state</code>, so we can work with more than one <code>State</code>
object.</li>
<li>We added a docstring that explains how to use a function and a
comment that explains how it works.</li>
<li>We added a state variable, <code>city_empty</code>, to count the number of
unhappy customers, which is a metric we’ll use to quantify how well
the system works.</li>
</ul>
</div>
</div>

<div id="outline-container-org6b768ed" class="outline-2">
<h2 id="org6b768ed"><span class="section-number-2">11.</span> References</h2>
<div class="outline-text-2" id="text-11">
<p>
Downey AB. Modeling and Simulation in Python. NoStarch
Press; 2023. <a href="https://allendowney.github.io/ModSimPy/">allendowney.github.io</a>
</p>

<p>
Python Software Foundation. Python (Version 3.8.10). Python Software
Foundation. Published 2021. Accessed August
19, 2023. <a href="https://www.python.org">python.org</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-09-26 Tue 14:06</p>
</div>
</body>
</html>